espressif/esp-dl/test_apps/model_perf/sdkconfig.defaults.esp32p4
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP=n
CONFIG_FATFS_LFN_HEAP=y
CONFIG_CAT_DETECT_MODEL_IN_SDCARD=y
CONFIG_COCO_DETECT_MODEL_IN_SDCARD=y
CONFIG_COCO_POSE_MODEL_IN_SDCARD=y
CONFIG_DOG_DETECT_MODEL_IN_SDCARD=y
CONFIG_HUMAN_FACE_DETECT_MODEL_IN_SDCARD=y
CONFIG_HUMAN_FACE_FEAT_MODEL_IN_SDCARD=y
CONFIG_IMAGENET_CLS_MODEL_IN_SDCARD=y
CONFIG_PEDESTRIAN_DETECT_MODEL_IN_SDCARD=y
CONFIG_BSP_SD_FORMAT_ON_MOUNT_FAIL=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
